Public Attributes | List of all members
API_Box Struct Reference
View Handling
Rectangular region of the model. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | xMin
double  | yMin
double  | xMax
double  | yMax
Detailed Description
Rectangular region of the model.
Remarks
It is a rectangle in model coordinates. Always expressed in meters, if no other instructions in the corresponding documentation. For the integer type representation refer to the API_Rect structure or to the ACAPI_View_CoordToPoint and ACAPI_View_CoordToPoint functions for the conversion algorithms.
Member Data Documentation
◆ xMax
 double API_Box::xMax
◆ xMin
 double API_Box::xMin
◆ yMax
 double API_Box::yMax
◆ yMin
 double API_Box::yMin